In [34]:
import pandas as pd
import numpy as np
import seaborn as sns

In [35]:
df = pd.read_csv("Social_Network_Ads.csv")

In [36]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [37]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [38]:
df.tail()

      User ID  Gender  Age  EstimatedSalary  Purchased
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [39]:
df.shape

(400, 5)

In [40]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [41]:
columns = list(df.columns)
columns.remove("User ID")

In [42]:
temp_gender_rows = pd.get_dummies(df['Gender'],prefix="gender")

In [43]:
df = df.join(temp_gender_rows)

In [44]:
df.drop(['User ID','Gender'],axis=1,inplace=True)

In [45]:
df

     Age  EstimatedSalary  Purchased  gender_Female  gender_Male
0     19            19000          0              0            1
1     35            20000          0              0            1
2     26            43000          0              1            0
3     27            57000          0              1            0
4     19            76000          0              0            1
..   ...              ...        ...            ...          ...
395   46            41000          1              1            0
396   51            23000          1              0            1
397   50            20000          1              1            0
398   36            33000          0              0            1
399   49            36000          1              1            0

[400 rows x 5 columns]

In [46]:
x=df.iloc[:,[0,1,3,4]]

In [47]:
y=df.iloc[:,[2]]

In [48]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.25)

In [49]:
from sklearn.model_selection import train_test_split

In [50]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
x_train = sc.fit_transform(x_train)
x_test = sc.fit_transform(x_test)

In [51]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression(random_state=0)

In [52]:
classifier.fit(x_train,y_train)

c:\users\bhuva\appdata\local\programs\python\python38\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

LogisticRegression(random_state=0)

In [53]:
y_pred = classifier.predict(x_test)

In [62]:
from sklearn.metrics import confusion_matrix, accuracy_score

In [58]:
cm = confusion_matrix(y_test,y_pred)

In [59]:
cm

array([[57,  3],
       [12, 28]], dtype=int64)

In [63]:
print(accuracy_score(y_test,y_pred)*100)

85.0